# NewElementSet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewElementSet Method
Application Class See Also
---
Creates a new instance of a set specifically for holding elements.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementSet NewElementSet()
```

Visual Basic
---
```text
Public Function NewElementSet As ElementSet
```

Visual C++
---
```text
public:
ElementSet^ NewElementSet()
```

# ### Return Value
A new Element Set.
# Remarks
This is a general purpose set for passing elements to and from methods.
# See Also
Application Class
Autodesk.Revit.Creation Namespace